In [1]:
from connection import connection_string

In [2]:
# 加载 ipython-sql 扩展
%load_ext sql

# 连接到 PostgreSQL 数据库
%sql $connection_string

## 重建数据库

我在windows平台安装的postgresql和pgAdmin，在pgAdmin操作的时候经常显示下面的错误：

```bash
Failed to retrieve data from the server
无效的"UTF8"编码字节顺序：0xc8 0xd5
```

后来使用下面的sql语句，发现datcollate、datctype字段不是utf8格式：

```sql
SELECT datname, encoding, datcollate, datctype FROM pg_database;
```

使用下面的sql重建数据库解决问题

```sql
CREATE DATABASE tysql
WITH ENCODING='UTF8'
LC_COLLATE='en_US.UTF-8'
LC_CTYPE='en_US.UTF-8'
TEMPLATE=template0;
```

## 简单查询

In [3]:
%%time
%%sql

select prod_name
from products

 * postgresql://postgres:***@localhost:5432/tysql
9 rows affected.
CPU times: total: 15.6 ms
Wall time: 17.5 ms

[('8 inch teddy bear                                                                                                                                                                                                                                              ',),
 ('12 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('18 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('Fish bean bag toy                                                                                                                                                                                                                                              ',),
 ('Bird bean bag toy                                                                                                                                                                                                                                              ',),
 ('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

sql语句不区分大小写

## 分页查询

In [4]:
%%sql

select prod_name
from products
limit 5

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('8 inch teddy bear                                                                                                                                                                                                                                              ',),
 ('12 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('18 inch teddy bear                                                                                                                                                                                                                                             ',),
 ('Fish bean bag toy                                                                                                                                                                                                                                              ',),
 ('Bird bean bag toy                                                                                                                                                                                                                                              ',)]

In [5]:
%%sql

select prod_name
from products
limit 5 offset 5

 * postgresql://postgres:***@localhost:5432/tysql
4 rows affected.

[('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

行的序号从0开始，limit 1 offset 0是第1行（也可以称为第0行）

## 注释的写法

In [6]:
%%sql

/*
多行注释
*/

select prod_name -- 单行注释
from products
limit 5 offset 5

 * postgresql://postgres:***@localhost:5432/tysql
4 rows affected.

[('Rabbit bean bag toy                                                                                                                                                                                                                                            ',),
 ('Raggedy Ann                                                                                                                                                                                                                                                    ',),
 ('King doll                                                                                                                                                                                                                                                      ',),
 ('Queen doll                                                                                                                                                                                                                                                     ',)]

## 查看数据库schema

In [7]:
%%sql

select *
from pg_catalog.pg_tables
where schemaname not in ('pg_catalog', 'information_schema')

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('public', 'orders', 'postgres', None, True, False, True, False),
 ('public', 'orderitems', 'postgres', None, True, False, True, False),
 ('public', 'products', 'postgres', None, True, False, True, False),
 ('public', 'customers', 'postgres', None, True, False, True, False),
 ('public', 'vendors', 'postgres', None, True, False, True, False)]

In [8]:
%%sql

select column_name, data_type, is_nullable, column_default
from information_schema.columns
where table_name = 'products'

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('prod_price', 'numeric', 'NO', None),
 ('prod_id', 'character', 'NO', None),
 ('vend_id', 'character', 'NO', None),
 ('prod_name', 'character', 'NO', None),
 ('prod_desc', 'character varying', 'YES', None)]

## 做题

In [9]:
%%sql

select cust_id from customers

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('1000000001',),
 ('1000000002',),
 ('1000000003',),
 ('1000000004',),
 ('1000000005',)]

In [10]:
%%sql

select distinct prod_id from orderitems

 * postgresql://postgres:***@localhost:5432/tysql
7 rows affected.

[('BNBG01    ',),
 ('BNBG03    ',),
 ('BNBG02    ',),
 ('BR03      ',),
 ('BR01      ',),
 ('RGAN01    ',),
 ('BR02      ',)]

In [11]:
%%sql

-- select * from customers

select cust_id from customers;

 * postgresql://postgres:***@localhost:5432/tysql
5 rows affected.

[('1000000001',),
 ('1000000002',),
 ('1000000003',),
 ('1000000004',),
 ('1000000005',)]